//Дополнительные задания
//Дана json-строка (можно сохранить в файл и читать из файла)
//[{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
// {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
//Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида:
// Студент [фамилия] получил [оценка] по предмету [предмет].
//Пример вывода:
//Студент Иванов получил 5 по предмету Математика.
//Студент Петрова получил 4 по предмету Информатика.
//Студент Краснов получил 5 по предмету Физика.

public class Main3 {
    public static void main(String[] args) {
        String strJSON = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
                "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}," +
                "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";
        System.out.println(strJSON);
        System.out.println(Conversion(strJSON));
    }

    public static String Conversion(String str) {
        str = str.replace("[", "");
        str = str.replace("]", "");
        str = str.replace("{", "\n");
        str = str.replace(":", "");
        str = str.replace(",", "");
        str = str.replace("},", ".");
        str = str.replace("\"", "");
        str = str.replace("}", ". ");
        str = str.replace("фамилия", "Студент ");
        str = str.replace("оценка", " получил ");
        str = str.replace("предмет", " по предмету ");

        return str;
    }
}